projects/app/Http/Controllers/PageController.php

    function propertyDetail($seo_url){
        $data=HostFullyProperty::where("seo_url",$seo_url)->where(["isActive"=>"1","status"=>"true"])->first();
---
select * from `host_fully_properties` where `seo_url` = 'under-the-sea-vacation-pool-spa-home-71aa1e59-9d5f-46f1-b799-a0a582ceb56a' and (`isActive` = '1' and `status` = 'true') limit 1

    function attractionSingle($seo_url){
        $data=Attraction::where("seo_url",$seo_url)->first();
---
select * from `attractions` where `seo_url` = 'legoland' limit 1

    function blogSingle($seo_url){
        $data=Blog::where("seo_url",$seo_url)->first();
        if($data){
            $category=BlogCategory::find($data->blog_category_id);
---
select * from `blogs` where `seo_url` = 'blog-one-copy' limit 1
select * from `blog_categories` where `blog_categories`.`id` = '1' limit 1

    function checkAjaxGetQuoteData(Request $request){
        if($request->property_id){
            $property=Property::find($request->property_id);
---
select * from `properties` where `properties`.`id` = '15' limit 1

    public function dynamicDataCategory(Request $request,$seo_url){
        if($seo_url=="home"){
          return redirect("/");
        }
        $data=Cms::where("seo_url",$seo_url)->first();
        if($data){
            $templete="front.static.".$data->templete;
            if($data->templete=="blogs"){
                $blogs=Blog::orderBy("id","desc")->paginate(12);
---
select * from `blogs` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `blogs`

    function sitemap(){
        $cms=Cms::all();    $blogs=Blog::all();    $blogcategories=BlogCategory::all();
---
select * from `blog_categories`
select * from `blogs`