projects/app/Helper/Helper.php

	function getGrossAmountData($property,$start_date,$end_date){
		$status=false;
		$gross_amount=0;
		$message='';
		$stay_flag=0;
		$day_gaurav=$this->getWeekNameSelect();
		$now = strtotime($start_date);
          $your_date = strtotime($end_date);
          $datediff =  $your_date-$now;
          $day= ceil($datediff / (60 * 60 * 24));
         $total_night=$day;
         if($day>0){
             if($property){
		         for($i=0;$i<$day;$i++){
		         	$date = strtotime($start_date);
		            $date = strtotime("+".$i." day", $date);
		            $date= date('Y-m-d', $date);
		            $rate=PropertyRate::where(["property_id"=>$property->id,"single_date"=>$date])->first();
---
select * from `property_rates` where (`property_id` = 15 and `single_date` = '2025-07-24') limit 1