projects/app/Helper/HostFully.php

    function getSearchDataHostFully($start_date,$end_date,$total_guests=1){
        $properties_uid=[];
        foreach(HostFullyAgency::all() as $agency){
---
select * from `host_fully_agencies`