projects/app/Helper/LiveCart.php

    function iCalDataCheckInCheckOut($property_id){
        $checkin=[];
        $checkout=[];
        $data=HostFullyPropertyPricePeriod::whereDate("from_date",">=",date('Y-m-d'))->where("isCheckinAllowed","0")->where("propertyUid",$property_id)->get();
        foreach($data as $c){
            $checkin[]=$c->from_date;
        }
        $data=HostFullyPropertyPricePeriod::whereDate("from_date",">=",date('Y-m-d'))->where("isCheckoutAllowed","0")->where("propertyUid",$property_id)->get();
        foreach($data as $c){
            $checkout[]=$c->from_date;
        }
        $data=HostFullyPropertyPricePeriod::whereDate("from_date",">=",date('Y-m-d'))->where("unavailable","1")->where("propertyUid",$property_id)->get();
---
select * from `host_fully_property_price_periods` where date(`from_date`) >= '2025-07-23' and `isCheckinAllowed` = '0' and `propertyUid` = '71aa1e59-9d5f-46f1-b799-a0a582ceb56a'
select * from `host_fully_property_price_periods` where date(`from_date`) >= '2025-07-23' and `isCheckoutAllowed` = '0' and `propertyUid` = '71aa1e59-9d5f-46f1-b799-a0a582ceb56a'
select * from `host_fully_property_price_periods` where date(`from_date`) >= '2025-07-23' and `unavailable` = '1' and `propertyUid` = '71aa1e59-9d5f-46f1-b799-a0a582ceb56a'

    function refreshIcalData($property_id,$ical_link,$id){
         IcalEvent::where(['ppp_id'=>$property_id,'event_pid'=>$property_id,'ical_link'=>$ical_link])->delete();
---
delete from `ical_events` where (`ppp_id` = 1 and `event_pid` = 1 and `ical_link` is null)

    function allIcalImportListRefresh(){
        $data=HostFullyProperty::all();
---
select * from `host_fully_properties`